INSERT INTO leader_quest_progress (
    quest_progress_id, frequency_type, period, status, updated_at, quest_id, department_id, employee_number, quest_progress_date
) VALUES
      (1, 'MONTH', 1,'MAX', '2025-01-11 13:24:23.000000', 1, '음성 1센터',2021030101, '0000-00-00 00:00:00.000000'),
      (2, 'MONTH', 2, 'MEDIUM', '2025-01-11 13:24:23.000000', 1, '음성 1센터',2021030101, '0000-00-00 00:00:00.000000'),
      (3, 'MONTH', 2, 'MEDIUM', '2025-01-11 13:24:23.000000', 1, '음성 1센터',2023010101, '0000-00-00 00:00:00.000000'),
      (4, 'MONTH', 1, 'MAX', '2025-01-11 13:24:23.000000', 1, '음성 1센터',2023010101, '0000-00-00 00:00:00.000000'),
      (5, 'MONTH', 2, 'MEDIUM', '2025-01-11 13:24:23.000000', 1, '음성 1센터',2023010102, '0000-00-00 00:00:00.000000'),
      (6, 'MONTH', 1, 'MAX', '2025-01-11 13:24:23.000000', 2, '음성 1센터', 2023010102, '0000-00-00 00:00:00.000000'),
      (7, 'MONTH', 2, 'MEDIUM', '2025-01-11 13:24:23.000000', 2, '음성 1센터',2021030101, '0000-00-00 00:00:00.000000'),
      (8, 'MONTH', 2, 'MEDIUM', '2025-01-11 13:24:23.000000', 2, '음성 1센터',2023010101, '0000-00-00 00:00:00.000000'),
      (9, 'MONTH', 2, 'MAX', '2025-01-11 13:24:23.000000', 2, '음성 1센터',2023010102, '0000-00-00 00:00:00.000000');


INSERT INTO leader_quest (
    quest_id, description, frequency_type, max_condition, max_exp_do, median_condition, median_exp_do, quest_title, updated_at, department_id
) VALUES
      (1, '4회 이상', 'MONTH', '4회 이상', 100, '2회 이상', 50, '월특근', '2025-01-11 12:27:55.000000', '음성 1센터'),
      (2, '목적(why)-과정(how)-결과(what) 에 대한 정리', 'MONTH', '업무프로세스 개선 리드자', 67, '업무프로세스 개선 참여자', 33, '업무개선', '2025-01-11 12:27:55.000000', '음성 1센터');
